Revit 2024 API
FailuresAccessor.DeleteAllWarnings Method
 Deletes all FailureMessages of severity "Warning" currently posted in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void DeleteAllWarnings()
Visual Basic
Public Sub DeleteAllWarnings
Visual C++
public:
void DeleteAllWarnings()
Remarks
 Warnings are deleted immediately and will not be accessible by any further failures processing. Any accessors for these failure messages become invalid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace